In [16]:
import pandas as pd
import numpy as np

In [17]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df['States'] = "CA NV AZ".split()
df.set_index('States',inplace=True)

In [18]:
df

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

## Dropping row or columns based on the nan values

In [19]:
df.dropna(axis=0)
## here i am giving axis = 0 hence it will drop the rows that have nan values

          A    B  C
States
CA      1.0  5.0  1

In [20]:
df.dropna(axis=1)
# ## here i am giving axis = 1 hence it will drop the columns that have nan values

        C
States
CA      1
NV      2
AZ      3

In [21]:
df.dropna(thresh=2)
## Here what happens when thresh is 2 then what happens is if the row contains less that 2 NON-NAN values then it 
## will be dropped

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2

In [22]:
df.dropna(thresh=2)
## here as you can see the rows are not getting dropped since the thresh is 1 and there is atleast one NON_NAN values
## in the dataframe

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2

In [23]:
df

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

## we have null values in the dataframe and now we should fill them using fillna

In [24]:
df.fillna(value="Fill value")
## here in place of value you can give whatever you want the NAN values to be filled with.

                 A           B  C
States
CA             1.0         5.0  1
NV             2.0  Fill value  2
AZ      Fill value  Fill value  3

## we will fill the null values by mean of column A

In [25]:
df.fillna(value=df['A'].mean())
## you can see below that the null values are being filled or replaced with the average of column A

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  1.5  2
AZ      1.5  1.5  3

In [26]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df1 = pd.DataFrame(data)
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

## groupby

In [27]:
df1.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [28]:
df1.columns

Index(['Company', 'Person', 'Sales'], dtype='object')

In [29]:
df1.groupby('Company')['Sales'].mean()
## here the using the groupby i found the mean of the sales from each company

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [30]:
df1.groupby('Company')['Sales'].sum()
## this is returning the summation of sales based on the companies

Company
FB      593
GOOG    320
MSFT    464
Name: Sales, dtype: int64

## performing describe operation on groupby

In [31]:
df1.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

### IN the below code i am using describe()['sales'] because it has index of the index hence used that

In [66]:
df1.groupby('Company').describe()['Sales'].loc[["GOOG","MSFT"],["std","min"]]

                std    min
Company
GOOG      56.568542  120.0
MSFT     152.735065  124.0

## to rotated the data using the # transpose method

In [70]:
d = df1.groupby('Company').describe()
d.transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000